var e=`---
title: "晶灿钻石/明亮珍珠孵化乱数"
navDrawerTitle: "孵化乱数"
description: "学习在已破解的 Switch 上进行晶灿钻石/明亮珍珠孵化乱数，获取理想个体的异色宝可梦。"
slug: "zh-cfw-bdsp-egg"
translation:
  enSlug: "cfw-bdsp-egg"
  language: "zh"
---

本指南会详细说明操作，但需要先掌握基础知识，尤其是 PokeFinder 的使用方式。

## 所需工具

- [PokeFinder](/pokefinder)
- CaptureSight
- 闪耀护符或国际孵化条件，也可以两者同时满足
- 飞翔功能

进行此孵化乱数，必须拥有闪耀护符，或使用国际孵化法。如果两者都没有，蛋会在从老爷爷处领取时生成。随意镇有较多乱数干扰，因此很难操作。满足国际孵化或闪耀护符条件后，蛋会改为在走完指定步数、变得可领取时生成，这样就可以飞到没有干扰的地点推进并生成蛋。

> [!NOTE]
> 在合适的地点推进时，不需要设置延迟。

> [!IMPORTANT]
> 开始前，请在 PokeFinder 中建立包含 TID/SID 的配置档案。必须填写实际 TID/SID，而不是 G8TID 等显示编号。可以通过 PKHeX 等存档编辑器，查看自己获得的宝可梦来确定。如果有闪耀护符，也要在档案中勾选。

1. 打开 PokeFinder，进入第八世代，点击“Egg”。如果找不到，请确认使用了正确版本。
2. 输入亲代的个体值、性格、道具（如红线或不变之石）及性别等信息，使用百变怪时也可以在此选择。国际孵化需勾选“Masuda”，有闪耀护符时别忘了在配置档案中勾选。
3. 在游戏中将亲代放入寄放屋。打开 CaptureSight 的“Daycare”标签页，可以看到从 180 开始的步数计数器。归零时会生成蛋。先走到剩余 1 步，再推进到目标，最后走出这一步。
4. 常用方式是飞回双叶镇的家，上楼后推进。这里稳定地每次推进 1，容易命中目标；可以保存并按需重启，也可以使用其他喜欢的推进方式。

生成结果后，找到目标推进数，利用各种方式接近。到达正确推进数时移动角色。为了准确触发走路，应使用摇杆，朝角色当前面向的相反方向移动，不要使用方向键。

5. 将种子输入 PokeFinder，点击生成，设置筛选条件并确定准确目标，然后开始推进。
6. 如果 CaptureSight 暂停了信息更新，先恢复更新，以观察推进数。按下方向键 \`上\`，切回控制游戏。此时不要移动，否则会提前生成蛋。目标较远时，可以按下 \`X\` 打开菜单，进入宝可梦图鉴，摇杆左右快速翻页以加速推进，也可以向下正常滚动，较慢地推进。注意不要超过目标。
7. 接近目标后，退出图鉴和菜单，准备走一步。CaptureSight 显示目标推进数时，使用左摇杆走一步，不要使用方向键，确保实际触发步数。
8. 走完后，打开 CaptureSight 的“Daycare”标签页，确认 Egg Seed 是否与目标一致。随后返回寄放屋领取蛋，再通过“Party”标签页查看蛋的 PID，确认是否命中。

## 特别鸣谢

- 中文翻译：白希洛/Hakuhiro
`;export{e as default};