var e=`---
title: "钻石/珍珠/白金蜜树乱数原理"
navDrawerTitle: "蜜树乱数"
description: "了解蜜树遇敌槽位，控制钻石、珍珠和白金的蜜树宝可梦，包括小卡比兽。"
slug: "zh-dppt-setup-rng"
translation:
  enSlug: "dppt-setup-rng"
  language: "zh"
---

## 介绍

本指南介绍如何通过在树上涂甜甜蜜，获得想要的宝可梦，重点说明小卡比兽的生成及对应树木的查找方式。

特别感谢 [Dragonfly Caves](https://www.dragonflycave.com/sinnoh/honey-trees) 对遇敌槽位和小卡比兽机制的研究。也可以通过该网站定位蜜树。

## 准备工作

1. 站在想要进行乱数的蜜树前。
2. 打开 [PokeFinder](/pokefinder)，进入 \`Gen 4 => Stationary => Method 1\`。
3. 启动游戏，记下初始种子，再生成结果。

## 乱数原理

蜜树的遇敌槽位可以看作一张表格。列决定遇敌类别，行决定具体宝可梦。

表格中的每一格对应一种结果。当前推进数之后的第 1 次乱数决定列，第 2 次乱数决定行。

例如当前为推进数 10，则由第 11 次推进的结果决定列，第 12 次决定行。

1. 取 PokeFinder 中接下来两个推进结果的 PID。
2. 保留 PID 的后半部分。
3. 转换为十进制。
4. 将十进制数除以 656，得到用于查表的行列数值。
5. 根据下表，判断最终会出现的宝可梦。

### 钻石/珍珠

| 行          | 第 1 列（30-99） | 第 2 列（10-29） | 第 3 列（0-9，小卡比兽树为 1-9） | 第 4 列（小卡比兽树为 0） |
| ----------- | ---------------- | ---------------- | -------------------------------- | ------------------------- |
| 40% (60-99) | 刺尾虫           | 三蜜蜂           | 无宝可梦                         | 小卡比兽                  |
| 20% (40-59) | 甲壳茧/盾甲茧    | 结草儿           | 无宝可梦                         | 小卡比兽                  |
| 20% (20-39) | 三蜜蜂           | 樱花宝           | 无宝可梦                         | 小卡比兽                  |
| 10% (10-19) | 结草儿           | 长尾怪手         | 无宝可梦                         | 小卡比兽                  |
| 5% (5-9)    | 樱花宝           | 赫拉克罗斯       | 无宝可梦                         | 小卡比兽                  |
| 5% (0-4)    | 长尾怪手         | 刺尾虫           | 无宝可梦                         | 小卡比兽                  |

### 白金

| 行          | 第 1 列（30-99） | 第 2 列（10-29） | 第 3 列（0-9，小卡比兽树为 1-9） | 第 4 列（小卡比兽树为 0） |
| ----------- | ---------------- | ---------------- | -------------------------------- | ------------------------- |
| 40% (60-99) | 三蜜蜂           | 结草儿           | 无宝可梦                         | 小卡比兽                  |
| 20% (40-59) | 刺尾虫           | 樱花宝           | 无宝可梦                         | 小卡比兽                  |
| 20% (20-39) | 结草儿           | 三蜜蜂           | 无宝可梦                         | 小卡比兽                  |
| 10% (10-19) | 樱花宝           | 长尾怪手         | 无宝可梦                         | 小卡比兽                  |
| 5% (5-9)    | 长尾怪手         | 长尾怪手         | 无宝可梦                         | 小卡比兽                  |
| 5% (0-4)    | 长尾怪手         | 赫拉克罗斯       | 无宝可梦                         | 小卡比兽                  |

## 特别鸣谢

- 中文翻译：白希洛/Hakuhiro
`;export{e as default};