var e=`---
title: "绿宝石实机宝可病毒乱数"
navDrawerTitle: "宝可病毒"
description: "通过乱数操作，在绿宝石中感染宝可病毒。"
slug: "zh-emerald-pokerus-retail"
translation:
  enSlug: "emerald-pokerus-retail"
  language: "zh"
---

<Gist>要点：让宝可梦感染宝可病毒。</Gist>

## 宝可病毒

每次野生战斗结束后，队伍中的一只宝可梦有 1 / 21,845 的概率感染宝可病毒。感染期间，通过战斗获得的努力值会翻倍。要培育理想的低等级宝可梦，例如会龙之怒的 5 级图图犬，宝可病毒尤为重要。

![感染宝可病毒的宝可梦](/images/Emerald/pokerus.png)

## 流程概述

- **第一步**：确定感染宝可病毒的合适设置。
- **第二步**：创建对战录像，也可以结合绘画重置种子，加快每次尝试。
- **第三步**：完成战斗并校准，直到感染宝可病毒。

<Stepper titles={["寻找合适设置", "创建对战录像", "战斗与校准"]}>

<Step step={0}>

### 寻找合适设置

1. 填写允许考虑的设置，选择定点遭遇或野生遭遇。
   - **定点遭遇**：推荐变隐龙和霹雳电球。
     - **优点**：生成宝可梦时的乱数推进次数固定为 4 次，可以带上 6 只捡拾特性宝可梦，方便校准。
     - **缺点**：每次尝试后都要重置游戏。队首需要足够高的等级，才能一击击败对手。
   - **野生遭遇**：
     - **优点**：随时可尝试，重试更快。
     - **缺点**：生成宝可梦时会不确定地推进 18-100 次乱数，因此命中目标需要一定运气。
2. 点击“Find best setup”。
3. 从结果中选择方案。优先考虑等待时间短、有多个连续推进数可感染、且校准概率高的方案。
4. 按所选方案准备队伍，捡拾特性的宝可梦不能携带道具。
5. 前往没有活动 NPC 的遭遇地点，保存游戏。

<Gen3PokerusEmeraldFindSetup />

</Step>

<Step step={1}>

### 创建对战录像

对战录像可以保存和恢复乱数状态。利用此技巧，只需完整等待一次，后续每次乱数重试都会快很多。

在对战开拓区结束战斗后，无论胜负都可以保存录像。录像会记录战斗开始时的乱数状态。打开训练家卡，选择“Battle Record”，就能在任意地点播放录像，并将乱数状态重置为录像中战斗开始时的状态。

如果不使用绘画重置种子，创建对战录像是可选的。

<Gen3PokerusEmeraldCreateBattleVideo />

</Step>

<Step step={2}>

### 战斗与校准

1. 启动下方工具中的计时器。
2. 第一个计时器归零时，关闭对战录像。如果没有创建录像，则按下 \`Start + Select + A + B\` 软重启游戏。
3. 下一个计时器到点时，使用甜甜香气触发野生遭遇，或与所选定点宝可梦互动。
4. 击败对手，停在计时器指定的最后一条战斗消息处。不要逃跑，否则不会触发捡拾。
5. 最后一个计时器归零时，按下 \`A\` 结束战斗。
6. 检查队伍中每只宝可梦是否感染宝可病毒。如果有，恭喜你成功了！
7. 如果所有捡拾宝可梦都没有获得道具，这次结果无法校准，重新尝试即可。
8. 如果有捡到道具，在下方填写道具并点击“Generate”。
9. 找到最接近的结果，选择对应的更新操作，再使用调整后的校准值重复本步骤。
10. 重试前，取下所有宝可梦携带的道具。

<Gen3PokerusEmeraldBattleAndCalibrate />

</Step>

</Stepper>

## 特别鸣谢

- RainingChain：指南与工具。
- 中文翻译：白希洛/Hakuhiro
`;export{e as default};