var e=`---
title: "晶灿钻石/明亮珍珠定点乱数"
navDrawerTitle: "定点乱数"
description: "学习在已破解的 Switch 上进行定点乱数，获得完美个体或异色传说宝可梦。"
slug: "zh-cfw-bdsp-stationary"
translation:
  enSlug: "cfw-bdsp-stationary"
  language: "zh"
---

## 所需工具

- 已安装 CaptureSight 的 Switch（[安装指南](/install-capturesight)）
- [Chatot](https://chatot.pokemonrng.com/#/bdsp)
- [PokeFinder](/pokefinder)

## 第一步：设置工具

1. 从 Switch 主菜单启动游戏，暂时不要进入继续游戏界面。
2. 将 CaptureSight 显示的 4 个当前状态填入工具对应的 4 个输入栏。
   - 可以按下 \`A\` 暂停 CaptureSight 更新，避免抄写时状态变化。不过在开场画面操作通常不必暂停。
3. 输入目标宝可梦对应的延迟。
   - 具体数值见下方列表。
4. 如果目标保底三项完美个体，勾选“Set IVs”。
5. 调整目标宝可梦的筛选条件。
   - 无性别宝可梦需要在“Gender”中选择“Genderless”。
6. 生成结果，选择目标推进数。
   - 没有结果时，可以放宽筛选条件，或提高最大推进数。
   - 推进数越高，需要等待的时间越长。

> [!NOTE]
> CaptureSight 从打开浮层时开始记录乱数推进数。如果退出 Main RNG 窗口或关闭浮层，计数会重置。发生这种情况时，需要重新输入当前状态，更新目标推进数。

## 第二步：获取目标宝可梦

1. 目标推进数较高时，可以在进入最终等待界面前加速推进。
   - 各类推进方法见[帧数推进指南](/bdsp-advance-rng)。
2. 接近目标时，进入最终等待界面，或停在最后一次输入前。
   - 对应界面及延迟见下方列表。
3. 等待目标推进数出现，按下 \`A\` 领取宝可梦或开始战斗。

恭喜你！应该已经获得目标宝可梦。如果没有成功，可以重启游戏后重试。

> [!NOTE]
> 我们仍在收集更多宝可梦的延迟及最终等待界面，也就是生成结果前的最后一次输入。如果有基于 Chatot 网站测得的延迟与相关信息，欢迎在 GitHub 提交 issue，或在 Discord 提供反馈。

## 延迟与最终等待界面

### 御三家

- 延迟：64。
- 生成时机：从手提箱选择宝可梦后，确认“Yes”时。

> [!NOTE]
> 请在进入湖畔区域前保存。剧情期间会推进约 300 次，规划目标时需要考虑这部分推进。

### 洛托姆

- 延迟：90。
- 生成时机：“You thumped the TV Set.”。
- 无性别。

### 伊布

- 延迟：0。
- 生成时机：“You obtained an Eevee!”。

### 帝牙卢卡/帕路奇亚

- 延迟：84。
- 生成时机：对话结束后，第二次按下 \`A\` 开始战斗时。
- 无性别，保底三项完美个体。

![帕路奇亚](/images/Brilliant-Diamond-Shining-Pearl/Stationary/palkia.png)

> [!TIP]
> 通关后环境干扰较少，操作更容易。可以第一次遭遇时先击败帝牙卢卡/帕路奇亚，再击败四天王，让它重新出现。

### 骑拉帝纳

- 延迟：84。
- 最终等待界面：“Bishaaan!”。
- 无性别，保底三项完美个体。

### 席多蓝恩

- 延迟：84。
- 生成时机：“Gwogbogogo...”对话。
- 需要设置性别，保底三项完美个体。

### 雷吉奇卡斯

- 延迟：84。
- 生成时机：“Zut Zutt!”。
- 无性别，保底三项完美个体。

> [!NOTE]
> 角色眨眼可能使延迟出现偏差，通常会多 1 或 2 次推进。上面的数值基于断点测试，实际操作可能不同，需要自行尝试校准。

### 玫瑰公园

- 延迟：84。
- 最终等待界面：对话框。
- 部分宝可梦无性别，全部保底三项完美个体。

**注意：艾姆利多和克雷色利亚需要选择 Roamers 生成方式。**

### 艾姆利多

- 延迟：84。
- 生成时机：“Kyauun.”。

> [!NOTE]
> 角色眨眼可能使延迟出现偏差，通常会多 1 或 2 次推进。上面的数值基于断点测试，实际操作可能不同，需要自行尝试校准。

### 克雷色利亚

- 延迟：103 / 104。
- 生成时机：在它面前按下 \`A\`。

> [!NOTE]
> 角色眨眼可能使延迟出现偏差，通常会多 1 或 2 次推进。上面的数值基于断点测试，实际操作可能不同，需要自行尝试校准。

PokeFinder 支持神秘礼物生成。可以从[此处](https://projectpokemon.org/home/files/category/203-generation-8/)下载对应配信信息，导入 PokeFinder，以获得准确结果。

### 神秘礼物

- 延迟：0。
- 最终等待界面：在领取菜单中选定对应配信的瞬间。
- 部分无性别，部分保底三项完美个体，具体参考神秘礼物卡片信息。

> [!TIP]
> 建议在主角家二楼进行神秘礼物乱数，推进速度较慢。

## 特别鸣谢

- 中文翻译：白希洛/Hakuhiro
`;export{e as default};